<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#SQL-Introduction" data-toc-modified-id="SQL-Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>SQL Introduction</a></span></li><li><span><a href="#Connect-to-the-SQL" data-toc-modified-id="Connect-to-the-SQL-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Connect to the SQL</a></span></li><li><span><a href="#Know-your-database" data-toc-modified-id="Know-your-database-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Know your database</a></span></li><li><span><a href="#Create-pandas-dataframes" data-toc-modified-id="Create-pandas-dataframes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Create pandas dataframes</a></span></li><li><span><a href="#Make-dataframes-columns-dtype-good" data-toc-modified-id="Make-dataframes-columns-dtype-good-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Make dataframes columns dtype good</a></span></li><li><span><a href="#Create-pandas-df-of-all-tables-and-columns-names" data-toc-modified-id="Create-pandas-df-of-all-tables-and-columns-names-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Create pandas df of all tables and columns names</a></span></li><li><span><a href="#Section5:-SQL-Joins" data-toc-modified-id="Section5:-SQL-Joins-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Section5: SQL Joins</a></span><ul class="toc-item"><li><span><a href="#AS" data-toc-modified-id="AS-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>AS</a></span></li><li><span><a href="#JOIN" data-toc-modified-id="JOIN-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>JOIN</a></span><ul class="toc-item"><li><span><a href="#INNER-JOIN" data-toc-modified-id="INNER-JOIN-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>INNER JOIN</a></span><ul class="toc-item"><li><span><a href="#example-2" data-toc-modified-id="example-2-7.2.1.1"><span class="toc-item-num">7.2.1.1&nbsp;&nbsp;</span>example 2</a></span></li><li><span><a href="#example-3" data-toc-modified-id="example-3-7.2.1.2"><span class="toc-item-num">7.2.1.2&nbsp;&nbsp;</span>example 3</a></span></li><li><span><a href="#example-4" data-toc-modified-id="example-4-7.2.1.3"><span class="toc-item-num">7.2.1.3&nbsp;&nbsp;</span>example 4</a></span></li></ul></li><li><span><a href="#OUTER-JOIN" data-toc-modified-id="OUTER-JOIN-7.2.2"><span class="toc-item-num">7.2.2&nbsp;&nbsp;</span>OUTER JOIN</a></span></li></ul></li><li><span><a href="#UNION-and-UNION-ALL" data-toc-modified-id="UNION-and-UNION-ALL-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>UNION and UNION ALL</a></span></li></ul></li></ul></div>

# SQL Introduction

![](../images/sql_clauses.png)
![](../images/sql_mnemonic.png)

# Connect to the SQL

In [1]:
import numpy as np
import pandas as pd
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']
port = yaml_dict['port']

%load_ext sql
%sql postgres://postgres:$pw@localhost:$port/dvdrental

'Connected: postgres@dvdrental'

# Know your database

In [2]:
%%sql
SELECT TABLE_NAME
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = 'BASE TABLE'
AND TABLE_CATALOG='dvdrental'
and TABLE_NAME  not like 'pg_%'
and TABLE_NAME  not like 'sql_%'
-- order by table_name

 * postgres://postgres:***@localhost:5432/dvdrental
20 rows affected.

[('actor',),
 ('store',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('film_actor',),
 ('film_category',),
 ('inventory',),
 ('language',),
 ('rental',),
 ('staff',),
 ('payment',),
 ('film',),
 ('employee',),
 ('staffnew',),
 ('df',),
 ('sales2007q1',),
 ('sales2007q2',)]

In [3]:
%%sql
select column_name, data_type, character_maximum_length
    from INFORMATION_SCHEMA.COLUMNS 
    where table_name = 'customer';

 * postgres://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('customer_id', 'integer', None),
 ('store_id', 'smallint', None),
 ('first_name', 'character varying', 45),
 ('last_name', 'character varying', 45),
 ('email', 'character varying', 50),
 ('address_id', 'smallint', None),
 ('activebool', 'boolean', None),
 ('create_date', 'date', None),
 ('last_update', 'timestamp without time zone', None),
 ('active', 'integer', None)]

In [4]:
%%sql
-- select * from staff limit 2; -- This gives error in jupyter notebook
select * from actor limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))]

# Create pandas dataframes

In [5]:
staffs = pd.read_csv('../data/dvdrental/2187.dat', sep=r'\t',
                     header=None, engine='python')

cols = ['staff_id', 'first_name', 'last_name', 'address_id', 'email',
        'store_id', 'active', 'username', 'password', 'last_update',
        'picture']

staffs.columns = cols
staffs = staffs.head(2)
staffs['active'] = True
staffs.drop('picture',axis=1,inplace=True)
print(staffs.shape)
staffs.head()

(2, 10)

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.79328
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.79328

In [6]:
tables = ['staffs', 'category', 'film_category', 'country', 'actor',
          'language', 'inventory', 'payment', 'rental', 'city',
          'store', 'film', 'address', 'film_actor', 'customer']

staff = tables[0] # we do not use it, we use staffs dataframe. but keep name staffs.
category = tables[1]
film_category = tables[2]
country = tables[3]
actor = tables[4]
language = tables[5]
inventory = tables[6]
payment = tables[7]
rental = tables[8]
city = tables[9]
store = tables[10]
film = tables[11]
address = tables[12]
film_actor = tables[13]
customer = tables[14]

In [7]:
# first create separate sql tables so that we can convert them to pandas dataframes.
# staff = %sql select * from $staff;  # this fails
category = %sql select * from $category;
film_category = %sql select * from $film_category;
country = %sql select * from $country;
actor = %sql select * from $actor;
language = %sql select * from $language;
inventory = %sql select * from $inventory;
payment = %sql select * from $payment;
rental = %sql select * from $rental;
city = %sql select * from $city;
store = %sql select * from $store;
film = %sql select * from $film;
address = %sql select * from $address;
film_actor = %sql select * from $film_actor;
customer = %sql select * from $customer;

 * postgres://postgres:***@localhost:5432/dvdrental
16 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
1000 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
109 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
200 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
6 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
4581 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
14596 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
16044 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
600 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
1000 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
603 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
5462 rows affected.
 * postgres://postgres:***@localhost:5432/dvdrental
599 rows affected.

In [8]:
category = category.DataFrame()
film_category = film_category.DataFrame()
country = country.DataFrame()
actor = actor.DataFrame()
language = language.DataFrame()
inventory = inventory.DataFrame()
payment = payment.DataFrame()
rental = rental.DataFrame()
city = city.DataFrame()
store = store.DataFrame()
film = film.DataFrame()
address = address.DataFrame()
film_actor = film_actor.DataFrame()
customer = customer.DataFrame()

# Make dataframes columns dtype good

In [9]:
df_tables = [staffs, category, film_category, country, actor,
            language, inventory, payment, rental, city,
            store, film, address, film_actor, customer]

In [10]:
def show_first_value_and_dtype(num):
    df_tables_dtypes = [df_tables[i].dtypes.to_frame()
                        for i in range(len(df_tables)) ]
    df_tables_first_value = [df_tables[i].head(1).T
                             for i in range(len(df_tables)) ]

    display(pd.concat([df_tables_first_value[num], df_tables_dtypes[num]],
                      axis=1, sort=True,ignore_index=True)
     .rename(columns={0: 'value', 1: 'dtype'})
     .style.apply(lambda x: ['background: lightblue' 
                             if x['dtype'] == 'object'
                             else ''
                             for _ in x],axis=1)
            .set_caption('Dataframe name: ' + tables[num])
    )

In [11]:
len(tables)

15

In [12]:
show_first_value_and_dtype(0)

In [13]:
staffs['last_update'] = pd.to_datetime(staffs['last_update'])

payment['amount'] = pd.to_numeric(payment['amount'], errors='coerce')

film['rental_rate'] = pd.to_numeric(film['rental_rate'], errors='coerce')
film['replacement_cost'] = pd.to_numeric(film['replacement_cost'], errors='coerce')

customer['create_date'] = pd.to_datetime(customer['create_date'])

# Create pandas df of all tables and columns names

In [14]:
df_tables = [staffs, category, film_category, country, actor,
            language, inventory, payment, rental, city,
            store, film, address, film_actor, customer]

all_columns = [df.columns.tolist() for df in df_tables]
df_tables_cols = pd.DataFrame(all_columns).T.fillna('')
df_tables_cols.columns = tables
df_tables_cols

,staffs,category,film_category,country,actor,language,inventory,payment,rental,city,store,film,address,film_actor,customer
0,staff_id,category_id,film_id,country_id,actor_id,language_id,inventory_id,payment_id,rental_id,city_id,store_id,film_id,address_id,actor_id,customer_id
1,first_name,name,category_id,country,first_name,name,film_id,customer_id,rental_date,city,manager_staff_id,title,address,film_id,store_id
2,last_name,last_update,last_update,last_update,last_name,last_update,store_id,staff_id,inventory_id,country_id,address_id,description,address2,last_update,first_name
3,address_id,,,,last_update,,last_update,rental_id,customer_id,last_update,last_update,release_year,district,,last_name
4,email,,,,,,,amount,return_date,,,language_id,city_id,,email
5,store_id,,,,,,,payment_date,staff_id,,,rental_duration,postal_code,,address_id
6,active,,,,,,,,last_update,,,rental_rate,phone,,activebool
7,username,,,,,,,,,,,length,last_update,,create_date
8,password,,,,,,,,,,,replacement_cost,,,last_update
9,last_update,,,,,,,,,,,rating,,,active
10,,,,,,,,,,,,last_update,,,
11,,,,,,,,,,,,special_features,,,
12,,,,,,,,,,,,fulltext,,,

In [15]:
# find repeated column names
repeated_cols = (pd.Series([i for sub in all_columns for i in sub])
                 .value_counts()
                 .loc[lambda x: x>1]
                 .index.values.tolist()
                )
# create colors dict
cells = repeated_cols
colors = ['salmon', 'khaki','rosybrown','tomato',
          'olive', 'gray',  'mediumpurple',
          'orchid',  'plum','lavender', 'lightgreen',
          'lightsteelblue', 
          'lightblue','skyblue','orange','orangered'][:len(cells)]
cell_colors = dict(zip(cells,colors))

# colored dataframe
df_tables_cols.style.apply(lambda x: ["background: %s" % cell_colors[v] 
                          if  v in cell_colors.keys()
                          else "" for v in x], axis = 1)

# Section5: SQL Joins

- [SQL JOINS Explained with Venn Diagrams](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/)
- [SQL JOIN Examples](http://www.sql-join.com/)
- [Wikipedia Page on SQL JOINS](https://www.wikiwand.com/en/Join_(SQL))

![](../images/sql_joins.png)

## AS

In [16]:
%%sql
select * from payment limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577))]

In [17]:
%%sql
select payment_id as pid from payment limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(17503,), (17504,)]

## JOIN

[Pandas Comparison with SQL](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html)

### INNER JOIN

In [18]:
%%sql
select * from customer limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [19]:
%%sql
select * from payment limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577))]

In [20]:
%%sql
-- only customer_id is in both tables, no need to do c.first_name, p.amount
select c.customer_id, first_name, last_name, email, amount, payment_date
from customer c
inner join payment p
on p.customer_id = c.customer_id
limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', Decimal('1.99'), datetime.datetime(2007, 2, 15, 8, 27, 50, 996577)),
 (524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', Decimal('4.99'), datetime.datetime(2007, 2, 16, 7, 53, 4, 996577))]

In [21]:
%%sql
select c.customer_id, c.first_name, c.last_name, c.email, p.amount, p.payment_date
from customer c
inner join payment p
on p.customer_id = c.customer_id
limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', Decimal('1.99'), datetime.datetime(2007, 2, 15, 8, 27, 50, 996577)),
 (524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', Decimal('4.99'), datetime.datetime(2007, 2, 16, 7, 53, 4, 996577))]

In [22]:
customer.merge(payment, on='customer_id').head(2)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active,payment_id,staff_id,rental_id,amount,payment_date
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18202,1,1306,1.99,2007-02-15 08:27:50.996577
1,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18203,2,1651,4.99,2007-02-16 07:53:04.996577

In [23]:
pd.merge(customer, payment, on='customer_id').head(2)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active,payment_id,staff_id,rental_id,amount,payment_date
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18202,1,1306,1.99,2007-02-15 08:27:50.996577
1,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18203,2,1651,4.99,2007-02-16 07:53:04.996577

In [24]:
# pandas also offer inner join between df1Col and df2Index
indexed_payment = payment.set_index('customer_id')
pd.merge(customer, indexed_payment, left_on='customer_id', right_index=True).head(2)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active,payment_id,staff_id,rental_id,amount,payment_date
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18202,1,1306,1.99,2007-02-15 08:27:50.996577
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1,18203,2,1651,4.99,2007-02-16 07:53:04.996577

#### example 2

In [25]:
%%sql
select c.customer_id, first_name, last_name, email, amount, payment_date
from customer c
inner join payment p
on p.customer_id = c.customer_id
order by c.customer_id
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', Decimal('5.99'), datetime.datetime(2007, 2, 14, 23, 22, 38, 996577)),
 (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', Decimal('0.99'), datetime.datetime(2007, 2, 15, 16, 31, 19, 996577)),
 (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', Decimal('9.99'), datetime.datetime(2007, 2, 15, 19, 37, 12, 996577)),
 (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', Decimal('4.99'), datetime.datetime(2007, 2, 16, 13, 47, 23, 996577)),
 (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', Decimal('4.99'), datetime.datetime(2007, 2, 18, 7, 10, 14, 996577))]

In [26]:
customer.merge(payment, on='customer_id')\
['customer_id first_name last_name email amount payment_date'.split()]\
.sort_values('customer_id')\
.head()

,customer_id,first_name,last_name,email,amount,payment_date
37,1,Mary,Smith,mary.smith@sakilacustomer.org,4.99,2007-04-09 11:52:33.996577
26,1,Mary,Smith,mary.smith@sakilacustomer.org,0.99,2007-03-02 16:30:04.996577
27,1,Mary,Smith,mary.smith@sakilacustomer.org,4.99,2007-03-17 11:06:20.996577
28,1,Mary,Smith,mary.smith@sakilacustomer.org,0.99,2007-03-18 02:25:55.996577
29,1,Mary,Smith,mary.smith@sakilacustomer.org,0.99,2007-03-19 08:23:42.996577

#### example 3

In [27]:
%%sql
select c.customer_id, first_name, last_name, email, amount, payment_date
from customer c
inner join payment p
on p.customer_id = c.customer_id
where c.customer_id = 2
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', Decimal('2.99'), datetime.datetime(2007, 2, 17, 19, 23, 24, 996577)),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', Decimal('0.99'), datetime.datetime(2007, 3, 1, 8, 13, 52, 996577)),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', Decimal('0.99'), datetime.datetime(2007, 3, 2, 0, 39, 22, 996577)),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', Decimal('5.99'), datetime.datetime(2007, 3, 2, 6, 10, 7, 996577)),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', Decimal('6.99'), datetime.datetime(2007, 3, 2, 9, 12, 14, 996577))]

In [28]:
customer.merge(payment, on='customer_id')\
['customer_id first_name last_name email amount payment_date'.split()]\
.loc[lambda x: x.customer_id == 2]\
.head()

,customer_id,first_name,last_name,email,amount,payment_date
47,2,Patricia,Johnson,patricia.johnson@sakilacustomer.org,2.99,2007-02-17 19:23:24.996577
48,2,Patricia,Johnson,patricia.johnson@sakilacustomer.org,0.99,2007-03-01 08:13:52.996577
49,2,Patricia,Johnson,patricia.johnson@sakilacustomer.org,0.99,2007-03-02 00:39:22.996577
50,2,Patricia,Johnson,patricia.johnson@sakilacustomer.org,5.99,2007-03-02 06:10:07.996577
51,2,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6.99,2007-03-02 09:12:14.996577

#### example 4

In [29]:
%%sql
select c.customer_id, first_name, last_name, email, amount, payment_date
from customer c
inner join payment p
on p.customer_id = c.customer_id
where first_name like 'A%'
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(29, 'Angela', 'Hernandez', 'angela.hernandez@sakilacustomer.org', Decimal('0.99'), datetime.datetime(2007, 2, 19, 9, 7, 8, 996577)),
 (29, 'Angela', 'Hernandez', 'angela.hernandez@sakilacustomer.org', Decimal('0.99'), datetime.datetime(2007, 2, 19, 10, 10, 46, 996577)),
 (29, 'Angela', 'Hernandez', 'angela.hernandez@sakilacustomer.org', Decimal('7.99'), datetime.datetime(2007, 2, 19, 12, 1, 32, 996577)),
 (29, 'Angela', 'Hernandez', 'angela.hernandez@sakilacustomer.org', Decimal('2.99'), datetime.datetime(2007, 2, 19, 14, 10, 33, 996577)),
 (29, 'Angela', 'Hernandez', 'angela.hernandez@sakilacustomer.org', Decimal('2.99'), datetime.datetime(2007, 2, 19, 17, 46, 35, 996577))]

In [30]:
customer.merge(payment, on='customer_id')\
['customer_id first_name last_name email amount payment_date'.split()]\
.loc[lambda x: x.first_name.str.startswith('A')]\
.head()

,customer_id,first_name,last_name,email,amount,payment_date
732,29,Angela,Hernandez,angela.hernandez@sakilacustomer.org,0.99,2007-02-19 09:07:08.996577
733,29,Angela,Hernandez,angela.hernandez@sakilacustomer.org,0.99,2007-02-19 10:10:46.996577
734,29,Angela,Hernandez,angela.hernandez@sakilacustomer.org,7.99,2007-02-19 12:01:32.996577
735,29,Angela,Hernandez,angela.hernandez@sakilacustomer.org,2.99,2007-02-19 14:10:33.996577
736,29,Angela,Hernandez,angela.hernandez@sakilacustomer.org,2.99,2007-02-19 17:46:35.996577

In [31]:
%%sql
select * from inventory limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17))]

In [32]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

In [33]:
%%sql
select store_id, title 
from inventory i
join film f on i.film_id = f.film_id
limit 6;

 * postgres://postgres:***@localhost:5432/dvdrental
6 rows affected.

[(1, 'Academy Dinosaur'),
 (1, 'Academy Dinosaur'),
 (1, 'Academy Dinosaur'),
 (1, 'Academy Dinosaur'),
 (2, 'Academy Dinosaur'),
 (2, 'Academy Dinosaur')]

In [34]:
inventory.merge(film, on='film_id')[['store_id','title']].head(6)

   store_id             title
0         1  Academy Dinosaur
1         1  Academy Dinosaur
2         1  Academy Dinosaur
3         1  Academy Dinosaur
4         2  Academy Dinosaur
5         2  Academy Dinosaur

In [35]:
%%sql
select title, count(title)
from inventory i
inner join film f
on i.film_id = f.film_id
where store_id = 1
group by title
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('Academy Dinosaur', 4),
 ('Affair Prejudice', 4),
 ('Agent Truman', 3),
 ('Airplane Sierra', 2),
 ('Alabama Devil', 3)]

In [36]:
inventory.merge(film, on='film_id')\
.loc[lambda x: x['store_id'] == 1]\
['title']\
.value_counts()\
.sort_index()\
.head()

Academy Dinosaur    4
Affair Prejudice    4
Agent Truman        3
Airplane Sierra     2
Alabama Devil       3
Name: title, dtype: int64

In [37]:
%%sql
select title, count(title) as copies_at_store1
from inventory i
inner join film f
on i.film_id = f.film_id
where store_id = 1
group by title
order by title
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('Academy Dinosaur', 4),
 ('Affair Prejudice', 4),
 ('Agent Truman', 3),
 ('Airplane Sierra', 2),
 ('Alabama Devil', 3)]

In [38]:
(inventory.merge(film, on='film_id')
.loc[lambda x: x['store_id'] == 1]
['title']
.value_counts()
.sort_index()
.reset_index()
.rename(columns={'index': 'title','title':'copies_at_store1'})
.head()
)

              title  copies_at_store1
0  Academy Dinosaur                 4
1  Affair Prejudice                 4
2      Agent Truman                 3
3   Airplane Sierra                 2
4     Alabama Devil                 3

In [39]:
## another example

In [40]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

In [41]:
%%sql
select * from language limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'English             ', datetime.datetime(2006, 2, 15, 10, 2, 19)),
 (2, 'Italian             ', datetime.datetime(2006, 2, 15, 10, 2, 19))]

In [42]:
%%sql
select f.title, l.name as movie_language
from film f
join language l
on l.language_id = f.language_id
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('Chamber Italian', 'English             '),
 ('Grosse Wonderful', 'English             '),
 ('Airport Pollock', 'English             '),
 ('Bright Encounters', 'English             '),
 ('Academy Dinosaur', 'English             ')]

In [43]:
(film.merge(language, on='language_id')
 [['title','name']]
 .rename(columns={'title':'title','name':'movie_language'})
 .head()
)

               title        movie_language
0    Chamber Italian  English
1   Grosse Wonderful  English
2    Airport Pollock  English
3  Bright Encounters  English
4   Academy Dinosaur  English

### OUTER JOIN

In [44]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

In [45]:
%%sql
select * from inventory limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17))]

In [46]:
%%sql
select f.film_id, f.title,i.inventory_id
from film f
left outer join inventory i
on i.film_id = f.film_id
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(133, 'Chamber Italian', 612),
 (133, 'Chamber Italian', 613),
 (133, 'Chamber Italian', 614),
 (133, 'Chamber Italian', 615),
 (384, 'Grosse Wonderful', 1770)]

In [47]:
%%sql
select f.film_id, f.title,i.inventory_id
from film f
left outer join inventory i
on i.film_id = f.film_id
where i.inventory_id is null
order by f.film_id
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(14, 'Alice Fantasia', None),
 (33, 'Apollo Teen', None),
 (36, 'Argonauts Town', None),
 (38, 'Ark Ridgemont', None),
 (41, 'Arsenic Independence', None)]

In [48]:
(pd.merge(film, inventory, on='film_id', how='left')
 .sort_values('film_id')
 [['film_id','title','inventory_id']]
 .loc[lambda x: x['inventory_id'].isnull()]
 .head()
 .style.hide_index()
)

## UNION and UNION ALL

- Ref: https://www.w3schools.com/sql/sql_ref_union.asp
- Ref: https://www.techonthenet.com/sql/union_all.php

```sql

SELECT column-names
  FROM table-name
 UNION
SELECT column-names
  FROM table-name
```

**Example**
```sql
SELECT 'Customer' As Type, 
       FirstName + ' ' + LastName AS ContactName, 
       City, Country, Phone
  FROM Customer
UNION
SELECT 'Supplier', 
       ContactName, City, Country, Phone
  FROM Supplier
```

**Union all**
```sql
SELECT expression1, expression2, ... expression_n
FROM tables
[WHERE conditions]
UNION ALL
SELECT expression1, expression2, ... expression_n
FROM tables
[WHERE conditions];
```

**Example**
```sql
SELECT supplier_id
FROM suppliers
UNION ALL
SELECT supplier_id
FROM orders
ORDER BY supplier_id;
```

![](../images/sql_union_rules.png)
![](../images/sql_union.png)

In [49]:
sales2007q1 = pd.DataFrame({'name': ['Mike','Jon','Mary'],
                           'amount': [150_000.25, 132_000.75, 100_000]})
sales2007q1

   name     amount
0  Mike  150000.25
1   Jon  132000.75
2  Mary  100000.00

In [50]:
sales2007q2 = pd.DataFrame({'name': ['Mike','Jon','Mary'],
                           'amount': [120_000.25, 142_000.75, 100_000]})
sales2007q2

   name     amount
0  Mike  120000.25
1   Jon  142000.75
2  Mary  100000.00

In [51]:
%sql drop table sales2007q1
%sql persist sales2007q1

 * postgres://postgres:***@localhost:5432/dvdrental
Done.
 * postgres://postgres:***@localhost:5432/dvdrental

'Persisted sales2007q1'

In [52]:
%sql drop table sales2007q2
%sql persist sales2007q2

 * postgres://postgres:***@localhost:5432/dvdrental
Done.
 * postgres://postgres:***@localhost:5432/dvdrental

'Persisted sales2007q2'

In [53]:
%sql select * from sales2007q1

 * postgres://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(0, 'Mike', 150000.25), (1, 'Jon', 132000.75), (2, 'Mary', 100000.0)]

In [54]:
%sql select * from sales2007q2

 * postgres://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(0, 'Mike', 120000.25), (1, 'Jon', 142000.75), (2, 'Mary', 100000.0)]

In [55]:
# Mary has same row in both dataframes, union gets only one row

In [56]:
%%sql
select * from sales2007q1
union 
select * from sales2007q2;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2, 'Mary', 100000.0),
 (1, 'Jon', 142000.75),
 (1, 'Jon', 132000.75),
 (0, 'Mike', 150000.25),
 (0, 'Mike', 120000.25)]

In [57]:
pd.concat([sales2007q1, sales2007q2]).drop_duplicates().reset_index()

   index  name     amount
0      0  Mike  150000.25
1      1   Jon  132000.75
2      2  Mary  100000.00
3      0  Mike  120000.25
4      1   Jon  142000.75